# 171121 NumPy & Pandas 입문

## 2) Pandas

In [1]:
#pandas 불러오기

import pandas as pd
import numpy

In [2]:
#Series 생성
s1 = pd.Series([1,4,7,8,9,10,'a'])
s1

0     1
1     4
2     7
3     8
4     9
5    10
6     a
dtype: object

In [3]:
s2 = pd.Series([1,2,3,numpy.nan,4,5]) 
s2

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    5.0
dtype: float64

### 데이터 프레임(DataFrame)
- pandas의 데이터프레임은 2차원 리스트 혹은 배열과 유사한 자료구조
- 행렬(matrix)와 같이 행(row)과 열(column)로 이루어져 있으며, 인덱스를 이용해 접근 가능
- 두개의 축(axis)이 있어 행과 열을 관리

In [4]:
# 데이터 프레임 생성
df1 = pd.DataFrame(numpy.zeros((2,3)))
df1

     0    1    2
0  0.0  0.0  0.0
1  0.0  0.0  0.0

In [5]:
df2 = pd.DataFrame([[1,2,3],[4,5,6]])
df2

   0  1  2
0  1  2  3
1  4  5  6

In [6]:
names = ['John', 'Tim', 'Bruce']
grades = ['A+', 'B-', 'F']
df3 = pd.DataFrame({'name':names, 'grade':grades})
df3

  grade   name
0    A+   John
1    B-    Tim
2     F  Bruce

In [7]:
df = pd.DataFrame(numpy.random.randn(10,3), index = range(1,11), columns = list('abc'))
df

           a         b         c
1  -0.962020  1.727361 -1.214448
2   1.489986 -0.860422 -0.761993
3   0.570334 -0.107050  0.981126
4   0.931797 -0.512066 -1.404199
5  -0.008254  0.851223 -2.111246
6  -2.258401  2.074597  0.654413
7  -1.332110 -0.487859 -0.537689
8  -1.345660 -0.611563  0.265099
9  -0.616228  0.311802  0.574918
10  0.022913 -0.745098 -0.143773

### 데이터 열람

In [8]:
df.head()

          a         b         c
1 -0.962020  1.727361 -1.214448
2  1.489986 -0.860422 -0.761993
3  0.570334 -0.107050  0.981126
4  0.931797 -0.512066 -1.404199
5 -0.008254  0.851223 -2.111246

In [9]:
df.tail()

           a         b         c
6  -2.258401  2.074597  0.654413
7  -1.332110 -0.487859 -0.537689
8  -1.345660 -0.611563  0.265099
9  -0.616228  0.311802  0.574918
10  0.022913 -0.745098 -0.143773

In [10]:
# 인덱스(행) 데이터만 열람
df.index

RangeIndex(start=1, stop=11, step=1)

In [11]:
# 컬럼(열) 데이터만 열람
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [12]:
# 데이터 프레임 내의 데이터만 열람
df.values

array([[-0.96201984,  1.72736124, -1.21444755],
       [ 1.48998616, -0.86042168, -0.76199324],
       [ 0.57033403, -0.10705012,  0.98112627],
       [ 0.93179735, -0.51206568, -1.40419904],
       [-0.00825357,  0.85122299, -2.11124623],
       [-2.25840122,  2.07459687,  0.65441263],
       [-1.33210962, -0.48785889, -0.53768922],
       [-1.34565967, -0.61156322,  0.26509916],
       [-0.61622819,  0.31180174,  0.57491831],
       [ 0.02291333, -0.74509789, -0.1437728 ]])

In [13]:
# 데이터의 요약(수치형인 경우 기초 통계량)
df.describe()

               a          b          c
count  10.000000  10.000000  10.000000
mean   -0.350764   0.164093  -0.369779
std     1.163077   1.055222   1.012079
min    -2.258401  -0.860422  -2.111246
25%    -1.239587  -0.586689  -1.101334
50%    -0.312241  -0.297455  -0.340731
75%     0.433479   0.716368   0.497464
max     1.489986   2.074597   0.981126

In [14]:
df

           a         b         c
1  -0.962020  1.727361 -1.214448
2   1.489986 -0.860422 -0.761993
3   0.570334 -0.107050  0.981126
4   0.931797 -0.512066 -1.404199
5  -0.008254  0.851223 -2.111246
6  -2.258401  2.074597  0.654413
7  -1.332110 -0.487859 -0.537689
8  -1.345660 -0.611563  0.265099
9  -0.616228  0.311802  0.574918
10  0.022913 -0.745098 -0.143773

### 데이터 변경

In [15]:
# 전치(transpose) / 열과 행을 서로 바꿈
df.T

,1,2,3,4,5,6,7,8,9,10
a,-0.962020,1.489986,0.570334,0.931797,-0.008254,-2.258401,-1.332110,-1.345660,-0.616228,0.022913
b,1.727361,-0.860422,-0.107050,-0.512066,0.851223,2.074597,-0.487859,-0.611563,0.311802,-0.745098
c,-1.214448,-0.761993,0.981126,-1.404199,-2.111246,0.654413,-0.537689,0.265099,0.574918,-0.143773

In [16]:
# 정렬(sorting) / 특정 컬럼의 값 'b'을 기준으로 정렬
df.sort_values(by = 'b')

           a         b         c
2   1.489986 -0.860422 -0.761993
10  0.022913 -0.745098 -0.143773
8  -1.345660 -0.611563  0.265099
4   0.931797 -0.512066 -1.404199
7  -1.332110 -0.487859 -0.537689
3   0.570334 -0.107050  0.981126
9  -0.616228  0.311802  0.574918
5  -0.008254  0.851223 -2.111246
1  -0.962020  1.727361 -1.214448
6  -2.258401  2.074597  0.654413

In [17]:
# 삽입(insertion) / 새로운 컬럼을 삽입
df['d'] = numpy.random.random(10)
df

           a         b         c         d
1  -0.962020  1.727361 -1.214448  0.649814
2   1.489986 -0.860422 -0.761993  0.657746
3   0.570334 -0.107050  0.981126  0.013339
4   0.931797 -0.512066 -1.404199  0.633772
5  -0.008254  0.851223 -2.111246  0.585053
6  -2.258401  2.074597  0.654413  0.979241
7  -1.332110 -0.487859 -0.537689  0.331828
8  -1.345660 -0.611563  0.265099  0.723169
9  -0.616228  0.311802  0.574918  0.834096
10  0.022913 -0.745098 -0.143773  0.348493

### 데이터 선택

In [18]:
# 컬럼 선택 / 특정 컬럼 'a'의 데이터를 선택
x = df['a']
x

1     0.013732
2    -0.541820
3    -0.937033
4    -0.878616
5     0.152424
6    -1.159200
7    -0.101005
8    -0.157936
9    -0.920150
10    1.231438
Name: a, dtype: float64

In [19]:
type(x) # 결과는 series

pandas.core.series.Series

In [18]:
# 슬라이싱(slicing) / 행을 기준으로 데이터를 자를 수 있음
df[0:5]

          a         b         c         d
1 -0.962020  1.727361 -1.214448  0.649814
2  1.489986 -0.860422 -0.761993  0.657746
3  0.570334 -0.107050  0.981126  0.013339
4  0.931797 -0.512066 -1.404199  0.633772
5 -0.008254  0.851223 -2.111246  0.585053

In [19]:
df[5:]

           a         b         c         d
6  -2.258401  2.074597  0.654413  0.979241
7  -1.332110 -0.487859 -0.537689  0.331828
8  -1.345660 -0.611563  0.265099  0.723169
9  -0.616228  0.311802  0.574918  0.834096
10  0.022913 -0.745098 -0.143773  0.348493

### 데이터 병합

In [20]:
df1 = pd.DataFrame([[1,2,3],[4,5,6]])
df1

   0  1  2
0  1  2  3
1  4  5  6

In [21]:
df2 = pd.DataFrame([[7,8,9],[10,11,12]])
df2

    0   1   2
0   7   8   9
1  10  11  12

In [22]:
# concat() 함수 / 축을 설정하지 않은 경우, 데이터를 컬럼을 기준으로 병합
pd.concat([df1,df2])

    0   1   2
0   1   2   3
1   4   5   6
0   7   8   9
1  10  11  12

In [23]:
# concat() 함수 / 축을 axis = 1로 설정한 경우, 행을 기준으로 병합
pd.concat([df1,df2], axis=1)

   0  1  2   0   1   2
0  1  2  3   7   8   9
1  4  5  6  10  11  12

### 데이터 호출

In [24]:
df = pd.read_csv('data/csv_data.csv')
df

   ID LAST_NAME  AGE
0   1       KIM   30
1   2      CHOI   25
2   3       LEE   41
3   4      PARK   19
4   5       LIM   36

In [25]:
df=pd.read_excel('data/excel_data.xlsx')
df

   ID LAST_NAME  AGE
0   1       KIM   30
1   2      CHOI   25
2   3       LEE   41
3   4      PARK   19
4   5       LIM   36

### 데이터 저장

In [26]:
df.to_csv('data/data.csv', sep=',')

In [27]:
df.to_excel('data/data.xlsx')

## pandas 실습

### 실습 2-8  DataFrame 생성하기

In [39]:
title = ['Skyfall','Lose Yourself','Another Brick in the Wall','Use Somebody','Treasure']
artist = ['Adele', 'Eminem', 'Pink Floyd','Kings of Leon', 'Bruno Mars']
length = ['4:46', '5:26', '3:56','3:51', '2:58']
year = [2012, 2002, 1979,2008,2013]

data = pd.DataFrame({'Title':title, 'Artist':artist, 'Length':length, 'Year':year})
data

          Artist Length                      Title  Year
0          Adele   4:46                    Skyfall  2012
1         Eminem   5:26              Lose Yourself  2002
2     Pink Floyd   3:56  Another Brick in the Wall  1979
3  Kings of Leon   3:51               Use Somebody  2008
4     Bruno Mars   2:58                   Treasure  2013

### 실습2-9 DataFrame 나누기

In [40]:
# 방법1
title_lowercase = [t.lower() for t in data['Title']]
title_lowercase

['skyfall',
 'lose yourself',
 'another brick in the wall',
 'use somebody',
 'treasure']

In [42]:
# 방법2
title_lowercase = []
for t in data['Title']:
    title_lowercase.append(t.lower())
title_lowercase

['skyfall',
 'lose yourself',
 'another brick in the wall',
 'use somebody',
 'treasure']

### 실습 2-10

In [43]:
# 엑셀 데이터 불러오기
data = pd.read_excel('data/animals.xlsx')
data.head()

,name,hair,feathers,eggs,milk,airborne,aquatic,predator,toothed,backbone,breathes,venomous,fins,legs,tail,domestic,catsize,type
0,aardvark,1,0,0,1,0,0,1,1,1,1,0,0,4,0,0,1,1
1,antelope,1,0,0,1,0,0,0,1,1,1,0,0,4,1,0,1,1
2,bass,0,0,1,0,0,1,1,1,1,0,0,1,0,1,0,0,4
3,bear,1,0,0,1,0,0,1,1,1,1,0,0,4,0,0,1,1
4,boar,1,0,0,1,0,0,1,1,1,1,0,0,4,1,0,1,1

#### 컬럼 추출
- 'name','hair','feathers' 의 데이터만 포함하는 데이터 프레임 생성
- .loc[] .iloc[]를 통해 슬라이싱(slicing)

In [44]:
animals = data.loc[:, ['name','hair','feathers']]
animals.head(11)

        name  hair  feathers
0   aardvark     1         0
1   antelope     1         0
2       bass     0         0
3       bear     1         0
4       boar     1         0
5    buffalo     1         0
6       calf     1         0
7       carp     0         0
8    catfish     0         0
9       cavy     1         0
10   cheetah     1         0

In [45]:
# 엑셀 파일로 저장
animals.to_excel('data/animals_sub.xlsx')